#+TITLE: Matrix Powers Kernel

* What's up next
   
** TODO [#A] MTX format should be exact
*** DONE Compilation and diagnostics
   #+BEGIN_SRC bash :results none
     make dmpk -B && ./dmpk pde900/pde900.mtx 7 6 10
   #+END_SRC

   #+BEGIN_SRC octave
     check; B = mmread("pde900/pde900.mtx")
     i=1; rv{i+1} - reshape(B^i*bb,30,30)'  % note the transpose!!!!
     %reshape(bb,30,30)
     %bb*1
   #+END_SRC

   #+RESULTS:
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 |                     0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
   | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 3.552713678800501e-15 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
*** DONE Conclusion
   Row 30 (last) column 8 (starting with 1) is off.
   
   So, i = 29*30+8 = 878, check out row 878 in the matrix...
*** DONE 
    Print row 878 (ie row 877 in Cpp) of the matrix in dmpk.cpp.
*** DONE Comparing output
    -1.278359382529999921374042060051579028367996215820312500000000000000000000000000000000000000000000000e+00
    -1.2783593825299999213740420600515790283679962158203125
    -0.01082101979530000063212114014277176465839147567749023437500000000000000000000000000000000000000000000e-02
    -0.010821019795300000632121140142771764658391475677490234375
    4.126069217899999586052217637188732624053955078125000000000000000000000000000000000000000000000000000e+00
    4.126069217899999586052217637188732624053955078125
    -1.568187251539999937932634566095657646656036376953125000000000000000000000000000000000000000000000000e+00
    -1.568187251539999937932634566095657646656036376953125

    30.56473135877639180080223013646900653839111328125
    30.56473135877639180080223013646900653839111328125000000000000000000000000000000000000000000000000000e+01
                     |||||||||||
    30.56473135877639535351590893696993589401245117187500000000000000000000000000000000 
*** TODO Debuging instructions
    I left a lot of output:
    - two for loops in the beginning
    - and the partition print for the first two iterations.

    Apperently the trouble is first in partition 6 (neighbouring with
    5), and then in partition 3.
** TODO Implement symmetric mtx file format reading
** TODO Implement the statistics for the paper
* Later
** TODO Separate the C and C++ versions
